; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob27) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate1)
	(at pallet3 distributor0)
	(clear crate4)
	(at pallet4 distributor1)
	(clear crate3)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 distributor1)
	(clear crate9)
	(at pallet7 depot2)
	(clear pallet7)
	(at pallet8 distributor1)
	(clear crate11)
	(at pallet9 depot2)
	(clear crate12)
	(at truck0 distributor0)
	(at truck1 depot2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 distributor2)
	(on crate2 pallet5)
	(at crate3 distributor1)
	(on crate3 pallet4)
	(at crate4 distributor0)
	(on crate4 crate0)
	(at crate5 distributor1)
	(on crate5 pallet8)
	(at crate6 distributor1)
	(on crate6 crate5)
	(at crate7 distributor1)
	(on crate7 crate6)
	(at crate8 distributor2)
	(on crate8 crate2)
	(at crate9 distributor1)
	(on crate9 pallet6)
	(at crate10 depot2)
	(on crate10 pallet9)
	(at crate11 distributor1)
	(on crate11 crate7)
	(at crate12 depot2)
	(on crate12 crate10)
)

(:goal (and
		(on crate0 crate7)
		(on crate1 pallet3)
		(on crate2 pallet8)
		(on crate4 pallet2)
		(on crate5 pallet7)
		(on crate6 pallet5)
		(on crate7 pallet0)
		(on crate8 pallet4)
		(on crate9 crate5)
		(on crate10 crate9)
		(on crate11 crate0)
		(on crate12 crate4)
	)
))

; plan
1. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 0 of 12
2. (lift hoist6 crate8 crate2 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist6) (on crate8 crate2)
   added: (lifting hoist6 crate8) (clear crate2)
   goals met: 0 of 12
3. (lift hoist5 crate2 pallet5 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet5)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 0 of 12
4. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 0 of 12
5. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 0 of 12
6. (load hoist6 crate8 truck0 distributor2)
   deleted: (lifting hoist6 crate8)
   added: (in crate8 truck0) (available hoist6)
   goals met: 0 of 12
7. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 0 of 12
8. (lift hoist3 crate4 crate0 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate0)
   added: (lifting hoist3 crate4) (clear crate0)
   goals met: 0 of 12
9. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 0 of 12
10. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 0 of 12
11. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 0 of 12
12. (unload hoist2 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   goals met: 0 of 12
13. (drop hoist2 crate4 crate12 depot2)
   deleted: (lifting hoist2 crate4) (clear crate12)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 crate12)
   goals met: 0 of 12
14. (lift hoist3 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet3)
   added: (lifting hoist3 crate0) (clear pallet3)
   goals met: 0 of 12
15. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 0 of 12
16. (load hoist3 crate0 truck0 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   goals met: 0 of 12
17. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 12
18. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 0 of 12
19. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 0 of 12
20. (load hoist2 crate1 truck1 depot2)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   goals met: 0 of 12
21. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 0 of 12
22. (unload hoist3 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist3)
   added: (lifting hoist3 crate1)
   goals met: 0 of 12
23. (drop hoist3 crate1 pallet3 distributor0)
   deleted: (lifting hoist3 crate1) (clear pallet3)
   added: (available hoist3) (at crate1 distributor0) (clear crate1) (on crate1 pallet3)
   goals met: 1 of 12
24. (lift hoist2 crate4 crate12 depot2)
   deleted: (at crate4 depot2) (clear crate4) (available hoist2) (on crate4 crate12)
   added: (lifting hoist2 crate4) (clear crate12)
   goals met: 1 of 12
25. (drop hoist2 crate4 pallet2 depot2)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 pallet2)
   goals met: 2 of 12
26. (lift hoist2 crate12 crate10 depot2)
   deleted: (at crate12 depot2) (clear crate12) (available hoist2) (on crate12 crate10)
   added: (lifting hoist2 crate12) (clear crate10)
   goals met: 2 of 12
27. (drop hoist2 crate12 crate4 depot2)
   deleted: (lifting hoist2 crate12) (clear crate4)
   added: (available hoist2) (at crate12 depot2) (clear crate12) (on crate12 crate4)
   goals met: 3 of 12
28. (lift hoist2 crate10 pallet9 depot2)
   deleted: (at crate10 depot2) (clear crate10) (available hoist2) (on crate10 pallet9)
   added: (lifting hoist2 crate10) (clear pallet9)
   goals met: 3 of 12
29. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 3 of 12
30. (load hoist2 crate10 truck1 depot2)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck1) (available hoist2)
   goals met: 3 of 12
31. (drive truck1 depot2 distributor1)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor1)
   goals met: 3 of 12
32. (lift hoist4 crate11 crate7 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 crate7)
   added: (lifting hoist4 crate11) (clear crate7)
   goals met: 3 of 12
33. (load hoist4 crate11 truck0 distributor1)
   deleted: (lifting hoist4 crate11)
   added: (in crate11 truck0) (available hoist4)
   goals met: 3 of 12
34. (lift hoist4 crate7 crate6 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 crate6)
   added: (lifting hoist4 crate7) (clear crate6)
   goals met: 3 of 12
35. (load hoist4 crate7 truck1 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck1) (available hoist4)
   goals met: 3 of 12
36. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 3 of 12
37. (unload hoist0 crate7 truck1 depot0)
   deleted: (in crate7 truck1) (available hoist0)
   added: (lifting hoist0 crate7)
   goals met: 3 of 12
38. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 3 of 12
39. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 4 of 12
40. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 4 of 12
41. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 4 of 12
42. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 4 of 12
43. (drop hoist0 crate0 crate7 depot0)
   deleted: (lifting hoist0 crate0) (clear crate7)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate7)
   goals met: 5 of 12
44. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 5 of 12
45. (unload hoist0 crate11 truck0 depot0)
   deleted: (in crate11 truck0) (available hoist0)
   added: (lifting hoist0 crate11)
   goals met: 5 of 12
46. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 5 of 12
47. (drop hoist0 crate11 crate0 depot0)
   deleted: (lifting hoist0 crate11) (clear crate0)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate0)
   goals met: 6 of 12
48. (lift hoist4 crate6 crate5 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 crate5)
   added: (lifting hoist4 crate6) (clear crate5)
   goals met: 6 of 12
49. (load hoist4 crate6 truck1 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck1) (available hoist4)
   goals met: 6 of 12
50. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 6 of 12
51. (unload hoist6 crate6 truck1 distributor2)
   deleted: (in crate6 truck1) (available hoist6)
   added: (lifting hoist6 crate6)
   goals met: 6 of 12
52. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 6 of 12
53. (drop hoist6 crate6 pallet5 distributor2)
   deleted: (lifting hoist6 crate6) (clear pallet5)
   added: (available hoist6) (at crate6 distributor2) (clear crate6) (on crate6 pallet5)
   goals met: 7 of 12
54. (unload hoist4 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist4)
   added: (lifting hoist4 crate10)
   goals met: 7 of 12
55. (drop hoist4 crate10 crate9 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate9)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate9)
   goals met: 8 of 12
56. (lift hoist4 crate5 pallet8 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 pallet8)
   added: (lifting hoist4 crate5) (clear pallet8)
   goals met: 8 of 12
57. (load hoist4 crate5 truck0 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck0) (available hoist4)
   goals met: 8 of 12
58. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 8 of 12
59. (unload hoist2 crate5 truck0 depot2)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   goals met: 8 of 12
60. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 8 of 12
61. (drop hoist2 crate5 pallet7 depot2)
   deleted: (lifting hoist2 crate5) (clear pallet7)
   added: (available hoist2) (at crate5 depot2) (clear crate5) (on crate5 pallet7)
   goals met: 9 of 12
62. (unload hoist4 crate2 truck0 distributor1)
   deleted: (in crate2 truck0) (available hoist4)
   added: (lifting hoist4 crate2)
   goals met: 9 of 12
63. (drop hoist4 crate2 pallet8 distributor1)
   deleted: (lifting hoist4 crate2) (clear pallet8)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 pallet8)
   goals met: 10 of 12
64. (lift hoist4 crate10 crate9 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate9)
   added: (lifting hoist4 crate10) (clear crate9)
   goals met: 9 of 12
65. (load hoist4 crate10 truck0 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck0) (available hoist4)
   goals met: 9 of 12
66. (lift hoist4 crate9 pallet6 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 pallet6)
   added: (lifting hoist4 crate9) (clear pallet6)
   goals met: 9 of 12
67. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   goals met: 9 of 12
68. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 9 of 12
69. (unload hoist2 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 9 of 12
70. (drop hoist2 crate9 pallet9 depot2)
   deleted: (lifting hoist2 crate9) (clear pallet9)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 pallet9)
   goals met: 9 of 12
71. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 9 of 12
72. (unload hoist4 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 9 of 12
73. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 9 of 12
74. (lift hoist2 crate9 pallet9 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist2) (on crate9 pallet9)
   added: (lifting hoist2 crate9) (clear pallet9)
   goals met: 9 of 12
75. (drop hoist2 crate9 crate5 depot2)
   deleted: (lifting hoist2 crate9) (clear crate5)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 crate5)
   goals met: 10 of 12
76. (unload hoist2 crate10 truck0 depot2)
   deleted: (in crate10 truck0) (available hoist2)
   added: (lifting hoist2 crate10)
   goals met: 10 of 12
77. (drop hoist2 crate10 crate9 depot2)
   deleted: (lifting hoist2 crate10) (clear crate9)
   added: (available hoist2) (at crate10 depot2) (clear crate10) (on crate10 crate9)
   goals met: 11 of 12
78. (drop hoist4 crate8 crate2 distributor1)
   deleted: (lifting hoist4 crate8) (clear crate2)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 crate2)
   goals met: 11 of 12
79. (lift hoist4 crate3 pallet4 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 pallet4)
   added: (lifting hoist4 crate3) (clear pallet4)
   goals met: 11 of 12
80. (drop hoist4 crate3 pallet6 distributor1)
   deleted: (lifting hoist4 crate3) (clear pallet6)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 pallet6)
   goals met: 11 of 12
81. (lift hoist4 crate8 crate2 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist4) (on crate8 crate2)
   added: (lifting hoist4 crate8) (clear crate2)
   goals met: 11 of 12
82. (drop hoist4 crate8 pallet4 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet4)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet4)
   goals met: 12 of 12
